#! /bin/bash

#传入的参数 有分号 ; 视为传参结束
#位置变量 $0-$9 保存从终端输入的每一个参数
echo "\$0 = $0"
echo "\$1 = $1"
echo "\$2 = $2"
echo "\$3 = $3"
echo "\$4 = $4"
echo "\$5 = $5"
echo "\$6 = $6"
echo "\$7 = $7"
echo "\$8 = $8"
echo "\$9 = $9"

#大于9要加{}
echo "\$10 = ${10}"

# $# 保存命令行传人的参数的个数 ,不包括$0
echo "\$# = $#"

# $@ 或 $* 保存所有命令行传入的参数,但是不包括 $0
echo "\$@ = $@"
echo "\$* = $*"

# $$ 获取当前进程的进程号
echo "\$$ = $$"

read NAME

echo "NAME = $NAME"

# $? 返回上条命令执行的状态 成功返回0 失败返回非0
ls
echo "\$? = $?"

ls fjdksl
echo "\$? = $?"

echo "\$0 = $0"
echo "\$0 = $0"
echo "\$0 = $0"